ITHACA-FV/tutorials/CFD/17YJunction/0/Ulift0
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Ulift0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
13046
(
(0.416974132882 -0.192073394958 0)
(0.534498918484 -0.26393875733 2.14012471436e-23)
(0.410603461669 -0.334104577754 -1.27610420499e-20)
(0.439099227472 -0.200671789731 0)
(0.382323535349 -0.2983967973 1.3062294436e-20)
(0.496798223448 -0.294574691842 0)
(0.453314550919 -0.187811333435 -1.57444267577e-21)
(0.52358192585 -0.303207263294 -3.19536241229e-21)
...
)
;

boundaryField
{
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet1
    {
        type            fixedValue;
        value           uniform (1 -1 0);
    }
    inlet2
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
