ITHACA-FV/tutorials/CFD/17YJunction/0/Ulifty0
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Ulifty0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
13046
(
(0 -0.192073394958 0)
(0 -0.26393875733 0)
(0 -0.334104577754 0)
(0 -0.200671789731 0)
(0 -0.2983967973 0)
(0 -0.294574691842 0)
(0 -0.187811333435 0)
(0 -0.303207263294 0)
...
)
;

boundaryField
{
    walls
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    inlet1
    {
        type            calculated;
        value           uniform (0 -1 0);
    }
    inlet2
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
30
(
(0 -0.0313644380952 0)
(0 -0.0679408091273 0)
(0 -0.0718553307917 0)
(0 -0.0674530579234 0)
(0 -0.0607369338671 0)
(0 -0.0534545726044 0)
(0 -0.0462497669046 0)
(0 -0.039422164946 0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
