ITHACA-FV/tutorials/CFD/17YJunction/0/Ulifty1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Ulifty1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
13046
(
(0 0.331810035612 0)
(0 0.195084091699 0)
(0 0.276895394245 0)
(0 0.281189577985 0)
(0 0.290271414137 0)
(0 0.190351955974 0)
(0 0.298466725944 0)
(0 0.189210401055 0)
...
)
;

boundaryField
{
    walls
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    inlet1
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    inlet2
    {
        type            calculated;
        value           uniform (0 1 0);
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
30
(
(0 -0.0313606128325 0)
(0 -0.0679293751775 0)
(0 -0.071836413469 0)
(0 -0.0674268646205 0)
(0 -0.0607037514679 0)
(0 -0.0534147646731 0)
(0 -0.0462037696952 0)
(0 -0.0393704823409 0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
